START_EMPLOYEE = "Привет, {first_name}! Выберите тип отчета:"
START_PARENT = "Привет, {first_name}!"
START_TRY_MERGE = (
    "Здравствуйте! Боту еще не известна ваша роль. Поделитесь контактом "
    "и затем напишите /start"
)

CHOOSE_GROUP = "Выберите группу"
GROUP_INFO = "{group_name} ({group_age_range})"

CHOOSE_CHILD = "Введите имя ребенка. Доступные дети\n"

WRITE_REPORT = "Напишите сообщение, которое хотите отправить родителям"
SEND_PICTURE = "Отправьте фото для родителей. Если фото нет, напишите любой текст"

SEND_PRESENTATION = "Отправьте файл с презентацией"
PRESENTATION_LINK = "Ссылка для объекта: {presentation_link}"

SUCCESSFULLY_SENT = "Сообщение было отправлено родителям :)"
SUCCESSFULLY_UPLOADED = "Презентация загружена :)"

NEXT = "Далее"
BACK = "Назад"

STOP_COMMAND_REPLY = "Пока!"

MERGE_USER_NOT_FOUND = (
    "Мы не смогли распознать вашу роль. Обратитесь, пожалуйста, к воспитателю для регистрации в боте ^_^\n"
    "Затем напишите /start"
)
MERGE_USER_UNEXPECTED_ERROR = (
    "При получении вашего номера произошла ошибка. "
    "Пожалуйста, попробуйте позже или обратитесь к разработчикам"
)

MERGE_SUCCESS = "Ваш номер телефона успешно добавлен. Пожалуйста, напишите /start"
